#DEFAULT VALIDATOR'S LABELS
localstrings.requiredstring=${getTextFromDB(fieldName)} \u00E8 richiesto.
localstrings.wrongCharacters=${getTextFromDB(fieldName)} contiene caratteri non validi.
localstrings.wrongDate=${getTextFromDB(fieldName)} contiene una data in formato non valido o non compresa tra 01/01/1900 e 31/12/2099.
localstrings.stringlength=${getTextFromDB(fieldName)} non pu\u00F2 essere pi\u00F9 lungo di ${getText(maxLength)} caratteri.
#localstrings.caplength=${getTextFromDB(fieldName)} deve essere lungo ${getText(maxLength)} caratteri.
localstrings.caplength=${getTextFromDB(fieldName)} deve essere lungo 5 caratteri.
localstrings.provinciaForNazioneEstera=${getTextFromDB(fieldName)} deve essere valorizzata per l''Italia.
localstrings.wrongCurrency=Il campo "${getTextFromDB(fieldName)}" contiene un importo in formato non valido (utilizzare esclusivamente numeri ed il punto decimale).
localstrings.wrongPercentuale=Il campo "${getTextFromDB(fieldName)}" contiene una percentuale in formato non valido (utilizzare esclusivamente numeri ed il punto decimale).
localstrings.wrongRibasso=Il campo "${getTextFromDB(fieldName)}" deve essere compreso tra 0 e 100.

#FILE UPLOAD ERRORS
Errors.fileNotSet=Allegare un documento.
Errors.emptyFile=Allegare un documento non vuoto.
Errors.overflowFileSize=Il documento \u00E8 stato scartato in quanto supera la dimensione massima accettabile. Si consiglia di ridurne le dimensioni.
Errors.overflowTotalFileSize=Il documento \u00E8 stato scartato a causa del superamento del limite massimo di byte allegabili, considerando tutti i documenti caricati. Si consiglia di ridurre le dimensioni dei file. 
Errors.overflowFileNameLength=Ridurre la lunghezza del nome del file.
Errors.invalidFileName=Il documento \u00E8 stato scartato in quanto il suo nome contiene caratteri non consentiti. Rinominare il file utilizzando solamente caratteri alfanumerici, spazi e nessun altro carattere speciale eccetto -_()[].
Errors.fileDescriptionMissing=Per poter inserire il documento occorre specificarne una descrizione.
Errors.fileNameExtensionNotSupported=Il documento \u00E8 stato scartato in quanto ha estensione non ammessa. Sono ammessi i soli file con estensione {0}.
Errors.p7mRequired=Allegare un file firmato digitalmente (estensione .p7m, .p7m.tsd, .pdf oppure .xml).
Errors.onlyP7m=Allegare un file firmato digitalmente in formato .p7m.
Errors.pdfRequired=Allegare un file PDF.
Errors.excelRequired=Allegare un file Excel (estensione .xls, .xlsx oppure .ods).
Errors.tsdRequired=Allegare un file con marcatura temporale (estensione .tsd).
Errors.xmlRequired=Allegare un file xml (estensione .xml).
Errors.cannotVerifySign=Impossibile verificare la firma digitale del documento allegato.
Errors.invalidSign=La firma digitale del documento non \u00E8 valida.
Errors.cannotVerifyUUID=Impossibile verificare l''UUID del documento allegato.
Errors.invalidUUID=L''UUID del documento non \u00E8 valido.
Errors.notAllowed=Azione non consentita.
Warning.signValidationNotSupported=Il sistema non \u00E8 stato in grado di eseguire le verifiche di validit\u00E0 della firma. Eseguire la verifica utilizzando strumenti alternativi esterni all''applicativo. 

#FILE DOWNLOAD ERRORS
Errors.fileDownload.noFile=Impossibile scaricare un documento inesistente.
Errors.fileDownload.noRights=Impossibile scaricare un documento inesistente oppure di cui non si possiede la visibilit\u00E0.

#ERRORS
Errors.sessionNotSynchronized=I dati inviati sono relativi ad una entit\u00E0 diversa rispetto ai dati in fase di raccolta all''interno dell''applicazione. Il processo viene terminato. ATTENZIONE: non aprire pi\u00F9 schede con il browser per navigare contemporaneamente pi\u00F9 entit\u00E0, \u00E8 un''operazione vietata.
Errors.sessionExpired=Sessione scaduta, effettuare nuovamente l''accesso.
Errors.unexpected=Si \u00E8 verificato un errore inaspettato durante l''elaborazione dell''operazione
Errors.unexpectedAndMessage=Si \u00E8 verificato un errore inaspettato durante l''elaborazione dell''operazione\: {0}
Errors.function.notSupported=Funzione non supportata
Errors.function.notEnabled=Funzione non abilitata
Errors.service.unreachable=Il servizio per l''interrogazione dei dati non \u00E8 raggiungibile
Errors.service.handshake=Il servizio per l''interrogazione dei dati non risponde correttamente
Errors.service.readDataWrong=Si \u00E8 verificato un errore durante l''interpretazione dei dati ricevuti dal servizio
Errors.searchForm.date.required="{0}" non valorizzata
Errors.searchForm.date.invalid="{0}" non valida ({1})
Errors.field.required="{0}" non valorizzato
Errors.field.invalid="{0}" non valido ({1})
Errors.tooManyDecimals="{0}" deve avere al massimo {1} cifre decimali
Errors.noDecimalsNeeded="{0}" non deve avere cifre decimali
Errors.tooManyChars="{0}" deve avere al massimo {1} caratteri
Errors.firmatarioNotSet=Per poter proseguire \u00E8 necessario selezionare un firmatario
Errors.firmatarioRtiNotSet=Per poter proseguire \u00E8 necessario selezionare tutti i firmatari del raggruppamento
Errors.sso.configuration=Configurazione integrazione con il sistema {0} non corretta o non funzionante
Errors.sso.IncoerentConfiguration=Configurazione protocollo SSO non coerente
Errors.sso.parameterConfiguration=Configurazione del parametro {0} mancante o non corretta
Errors.sso.insufficientData=Errore nella ricezione dei dati dal sistema {0}: nome={1}, cognome={2}, azienda={3}, c.f.={4}, p.iva={5}, e-mail={6}
Errors.sso.readingData=Il processo di identificazione {0} \u00E8 stato interrotto o il sistema {0} non risponde correttamente.
Errors.sso.dataElaboration=Errore nell''elaborazione dei dati ricevuti dal sistema {0}
Errors.sso.motivazioneMandatory=Il campo motivazione \u00E8 obbligatorio
Errors.sso.portokenerrorgeneric=Si \u00E8 verificato un errore nel contattare il servizio Portoken
Errors.sso.portokenerrorcredentials=Le credenziali inserite sono errate, oppure l''utente non \u00E8 abilitato all''accesso
Errors.sso.mtokenerrorgeneric=Si \u00E8 verificato un errore nel contattare il servizio Mtoken
Errors.sso.mtokenerrorcredentials=Le credenziali inserite sono errate, oppure l''utente non \u00E8 abilitato all''accesso
Errors.sso.mtokenerrorexpired=Il certificato utente \u00E8 scaduto
Errors.sso.mtokenerrorsignature=Il certificato utente non \u00E8 firmato correttamente
Errors.sso.mtokenerrorcertificate=Si \u00E8 verificato un errore leggendo il certificato utente 
Errors.sso.mtokenerrorpublikey=Chiave pubblica non trovata

Errors.requiredstring={0} \u00E8 richiesto.
Errors.wrongField={0} non \u00E8 valido.
Errors.checkDatiObbligatori=Verificare i dati inseriti in quanto mancano dati obbligatori necessari per procedere all'invio.
Errors.ntpTimeout=L''operazione ({0}) non \u00E8 stata eseguita in quanto non \u00E8 stato possibile determinare la data ufficiale di presentazione della richiesta. Riprovare nuovamente.
Errors.ntpUnknownHost=L''operazione ({0}) non \u00E8 stata eseguita in quanto non \u00E8 stato possibile richiedere la data ufficiale di presentazione della richiesta. Contattare l''amministratore dell''applicativo.
Errors.ntpUnexpectedError=L''operazione ({0}) non \u00E8 stata eseguita in quanto si \u00E8 verificato un errore inaspettato in fase di determinazione della data ufficiale di presentazione della richiesta. Riprovare nuovamente.
Errors.richiestaFuoriTempoMassimo=La richiesta \u00E8 stata effettuata fuori tempo massimo\!

Errors.aggiornamentoAnagrafica.parseXml=L''applicativo non riesce ad interpretare correttamente i dati inseriti nella richiesta di aggiornamento anagrafica.
Errors.invioBuste.xmlBustaNotFound=L''applicativo non ha individuato i dati relativi alla {0}.
Errors.tipoPartecipazione.xmlTipoPartecipazioneNotFound=L''applicativo non ha individuato i dati inseriti nella richiesta di tipo partecipazione impresa.

Errors.document.notAvailable=Un documento richiesto non risulta piu' disponibile. Il documento allegato verra' eliminato dalla busta. Verificare l'elenco dei documenti allegati.
Errors.docUlteriorePresent=Il documento ulteriore non \u00E8 stato inserito in quanto ne \u00E8 gi\u00E0 presente un altro con la medesima descrizione.
Errors.docUlterioreOverflowFileNameLength=Nella {0} occorre ridurre la lunghezza del nome del file "{1}" allegato come documentazione ulteriore.
Errors.docRichiestoObbligatorioNotFound=Nella {0} occorre allegare il documento {1}.
Errors.docRichiestoOverflowFileNameLength=Nella {0} occorre ridurre la lunghezza del nome del file "{1}" allegato come documento richiesto.
Errors.cannotLoadAttachments=L''applicativo non riesce a rileggere i documenti allegati alla domanda. Riprovare pi\u00F9 tardi.
Errors.pdf.outOfMemory=L''applicativo non riesce a generare il PDF a causa dell''esaurimento della memoria disponibile. Riprovare pi\u00F9 tardi, e nel caso l''errore si ripeta si richiede di contattare il supporto tecnico.

Errors.deleteComunicazione=Non \u00E8 stato possibile eliminare la comunicazione con id {0}
Errors.updateStatoComunicazioneDaProcessare=La comunicazione con id {0} va forzata manualmente allo stato da processare.
Errors.dettaglioInvio.xmlNotFound=Impossibile estrarre i dati di dettaglio dalla comunicazione con id {0}.
Errors.invioComunicazione=Errore durante l'invio della comunicazione.

Errors.save.outOfMemory=L''applicativo non riesce a predisporre e salvare i dati in bozza a causa dell''esaurimento della memoria disponibile. Riprovare pi\u00F9 tardi, e nel caso l''errore si ripeta si richiede di contattare il supporto tecnico.
Errors.send.outOfMemory=L''applicativo non riesce a predisporre ed inviare i dati a causa dell''esaurimento della memoria disponibile. Riprovare pi\u00F9 tardi, e nel caso l''errore si ripeta si richiede di contattare il supporto tecnico.

# SENDMAIL ERRORS
Errors.sendMailError=a causa di problemi nel server di posta, non \u00E8 stato possibile inviare la ricevuta della richiesta, pertanto si prega di stampare e conservare la presente pagina.
Errors.sendProtocolloConnectionError=Per errori durante la connessione al server di posta, non \u00E8 stato possibile inviare la richiesta all''ufficio protocollo.
Errors.sendProtocolloMailError=Per errori durante la composizione della mail, non \u00E8 stato possibile inviare la richiesta all''ufficio protocollo.

