#ERRORI GENERICI
Errors.profile.notFound=Profil f\u00FCr den Wirtschaftsteilnehmer {0} nicht gefunden

#ERRORI ACCESSO SINGLE SIGN ON
Errors.sso.anotherDelegateUser=Betrieb blockiert, da Sie zwar als registrierter Teilnehmer aufscheinen, aber die Kontrolle an folgendes Subjekt delegiert haben: {0}

#ERRORI REGISTRAZIONE MANUALE OPERATORI ECONOMICI
Errors.regManuale.noComselected=W\u00E4hlen Sie eine Registrierungsanfrage
Errors.regManuale.search=Es ist ein Fehler aufgetreten bei der Suche der Mitteilungen mit der Benutzung "{0}", Art Mitteilung "{1}"
Errors.regManuale.updateNoCom=Die Mitteilung mit der Id {0} kann nicht extrahiert werden
Errors.regManuale.updateError=Es ist ein Fehler aufgetreten bei der Wiederherstellung des Status \u0084Zu verarbeiten\u0093 f\u00FCr die Mitteilung {0} mit der Id {1}

#ERRORI OPERATORI ECONOMICI NON ATTIVI
Errors.opKO.noUserSelected=W\u00E4hlen Sie einen Wirtschaftsteilnehmer  
Errors.opKO.noMailUserSelected=F\u00FCr den gew\u00E4hlten Wirtschaftsteilnehmer scheint keine E-Mail auf
Errors.opKO.mailError=Es ist ein Fehler aufgetreten beim Versand der Aktivierungs-E-Mail an {0}

#ERRORI FLUSSI DA RIELABORARE
Errors.flussiKO.noComselected=W\u00E4hlen Sie einen Fluss, der erneut zu verarbeiten ist
Errors.flussiKO.search=Es ist ein Fehler aufgetreten bei der Suche der Mitteilungen mit der Benutzung "{0}", Art Mitteilung "{1}" und Bezug auf das Verfahren "{2}"
Errors.flussiKO.updateNoCom=Die Mitteilung mit der Id {0} kann nicht extrahiert werden
Errors.flussiKO.updateError=Es ist ein Fehler aufgetreten bei der Wiederherstellung des Status \u0084Zu verarbeiten\u0093 f\u00FCr die Mitteilung {0} mit der Id {1}

#ERRORI ASSISTENZA PER CONTO DI UN OPERATORE
Errors.sbloccaAccount.notFound=Kein Benutzer erkannt 

#ERRORI DELEGATE USER
Errors.delegateUser.alreadyExists=Der ausgew\u00E4hlte Benutzer hat bereits einen delegierten Betreff
Errors.delegateUser.notSet=Der ausgew\u00E4hlte Benutzer hat keinen Delegaten
Errors.delegateUser.notEqual=Der ausgew\u00E4hlte Benutzer hat einen anderen Delegierten als den angegebenen
Errors.user.notFound=Profil f\u00FCr Benutzer {0} nicht gefunden
Errors.delegateSSO.duplicatedCodiceFiscale=Für dieses Unternehmen existiert bereits ein delegiertes Subjekt mit demselben Steuerkennzeichen

# ERRORI PER ACCETTAZIONE CONSENSI
privacyBlocked=Um fortfahren zu k\u00F6nnen, braucht es die Einwilligung f\u00FCr die Verarbeitung der personenbezogenen Daten. Daf\u00FCr m\u00FCssen die angegebenen Bedingungen akzeptiert werden.
utilizzoPiattaformaBlocked=Um fortfahren zu k\u00F6nnen, braucht es die Einwilligung f\u00FCr die Verordnung f\u00FCr die Nutzung der Plattform.
Errors.datiImpresaIncompleti=Um fortzufahren, m\u00FCssen die Daten des Wirtschaftsteilnehmers ge\u00E4ndert werden, da diese unvollst\u00E4ndig sind. Bitte die Daten des Teilnehmers auf jeder einzelnen Seite bis zur \u00DCbersichtsseite pr\u00FCfen, die fehlenden Daten hinzuf\u00FCgen und anschlie\u00DFend auf \u0084Senden\u0093 klicken.

# SEND COMUNICAZIONE
label.registrazione.oggetto=Ansuchen Registrierung im Portal
label.registrazione.testo=Der Lieferant {0} sucht um Registrierung im Portal an. Mit freundlichen Gr\u00FC\u00DFen,
label.registrazione.allegatoRegistrazione.descrizione=Daten Ansuchen Registrierung

#AVVISI
Warnings.accessiConcorrentiUtente=Es scheinen {0} andere offene, nicht beendete oder nicht abgelaufene Arbeitssessionen von Benutzern auf, die sich mit Ihren Zugangsdaten authentifiziert haben

#MESSAGGI
Info.regManuale.approved=Der Registrierungsantrag wurde genehmigt
Info.regManuale.rejected=Die Registrierungsanfrage wurde abgelehnt und eine E-Mail an den Betreiber gesendet, um die Anfrage erneut zu senden 
Info.flussiKO.change=Der Status der Mitteilung {0} wurde erfolgreich ge\u00E4ndert
Info.opKO.mailMessage=Die Aktivierungs-E-Mail wurde erfolgreich an {0} versendet
Info.sbloccaAccount.change=Der Benutzer {0} wurde erfolgreich entsperrt und kann wieder normal arbeiten. Sie k\u00F6nnen versuchen, sich erneut anzumelden.
Info.delegateUser.change=Betreff mit Proxy f\u00FCr Nutzer {0} ({1}) ge\u00E4ndert
Info.accettazioneConsensi.confirmed=Annahme der Einwilligungen f\u00FCr Benutzer {0} erfolgreich durchgef\u00FChrt. Fahren Sie mit dem Authentifizierungsprozess erneut fort.

# FIELDS
username=USERNAME
olddelegateuser=OLDDELEGATEUSER
newdelegateuser=NEWDELEGATEUSER

motivoRifiuto=LABEL_MOTIVAZIONE_RIFIUTO